[net]
batch=128
subdivisions=1
height=256
width=256
channels=3
learning_rate=0.01
momentum=0.9
decay=0.0005

[crop]
crop_height=224
crop_width=224
flip=1
angle=0
saturation=1
exposure=1

[convolutional]
filters=64
size=11
stride=4
pad=0
activation=ramp

[maxpool]
size=3
stride=2

[convolutional]
filters=192
size=5
stride=1
pad=1
activation=ramp

[maxpool]
size=3
stride=2

[convolutional]
filters=384
size=3
stride=1
pad=1
activation=ramp

[convolutional]
filters=256
size=3
stride=1
pad=1
activation=ramp

[convolutional]
filters=256
size=3
stride=1
pad=1
activation=ramp

[maxpool]
size=3
stride=2

[connected]
output=4096
activation=ramp

[dropout]
probability=.5

[connected]
output=4096
activation=ramp

[dropout]
probability=.5

[connected]
output=1000
activation=ramp

[softmax]
groups=1

[cost]
type=sse

