[net]
inputs=256
momentum=0.9
decay=0.0
subdivisions=1
batch = 1
time_steps=1
learning_rate=.002
adam=1

policy=constant
power=4
max_batches=1000000

[gru]
output = 256

[gru]
output = 256

[gru]
output = 256

[connected]
output=256
activation=linear

[softmax]

