[net]
batch=1
subdivisions=1
height=10
width=10
channels=3
learning_rate=0.01
momentum=0.9
decay=0.0005

[convolutional]
filters=32
size=3
stride=1
pad=1
activation=leaky

[convolutional]
filters=32
size=3
stride=1
pad=1
activation=leaky

[maxpool]
stride=2
size=2

[convolutional]
filters=64
size=3
stride=1
pad=1
activation=leaky

[convolutional]
filters=64
size=3
stride=1
pad=1
activation=leaky

[maxpool]
stride=2
size=2

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=leaky

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=leaky

[maxpool]
stride=2
size=2

[convolutional]
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
filters=256
size=3
stride=1
pad=1
activation=leaky

[maxpool]
stride=2
size=2

[convolutional]
filters=512
size=3
stride=1
pad=1
activation=leaky

[convolutional]
filters=512
size=3
stride=1
pad=1
activation=leaky

[maxpool]
stride=2
size=2

[convolutional]
filters=1024
size=3
stride=1
pad=1
activation=leaky

[convolutional]
filters=1024
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

