[net]
subdivisions=1
inputs=256
batch = 128
momentum=0.9
decay=0.001
max_batches = 50000
time_steps=900
learning_rate=0.1

[rnn]
batch_normalize=1
output = 256
hidden=512
activation=leaky

[rnn]
batch_normalize=1
output = 256
hidden=512
activation=leaky

[rnn]
batch_normalize=1
output = 256
hidden=512
activation=leaky

[connected]
output=256
activation=leaky

[softmax]

[cost]
type=sse

