[net]
batch=1
subdivisions=1
height=256
width=256
channels=3
learning_rate=0.00001
momentum=0.9
decay=0.0005
seen=0

[crop]
crop_height=256
crop_width=256
flip=0
angle=0
saturation=1
exposure=1

[convolutional]
filters=32
size=7
stride=2
pad=1
activation=ramp

[convolutional]
filters=32
size=3
stride=2
pad=1
activation=ramp

[convolutional]
filters=32
size=3
stride=2
pad=1
activation=ramp

[convolutional]
filters=1
size=5
stride=1
pad=1
activation=logistic

[cost]
type=sse

