[net]
batch=128
subdivisions=2
height=256
width=256
channels=3
learning_rate=0.000001
momentum=0.9
decay=0.0005
seen=0

[crop]
crop_height=256
crop_width=256
flip=0
angle=0
saturation=1
exposure=1

[convolutional]
filters=32
size=3
stride=1
pad=1
activation=ramp

[convolutional]
filters=32
size=3
stride=1
pad=1
activation=ramp

[convolutional]
filters=32
size=3
stride=1
pad=1
activation=ramp

[convolutional]
filters=1
size=3
stride=1
pad=1
activation=logistic

[cost]

