[net]
batch=64
subdivisions=64
height=448
width=448
channels=3
learning_rate=0.01
momentum=0.9
decay=0.0005

[crop]
crop_width=448
crop_height=448
flip=0
angle=0
saturation = 2
exposure = 2

[convolutional]
filters=64
size=7
stride=2
pad=1
activation=ramp

[convolutional]
filters=192
size=3
stride=2
pad=1
activation=ramp

[convolutional]
filters=128
size=1
stride=1
pad=1
activation=ramp

[convolutional]
filters=256
size=3
stride=2
pad=1
activation=ramp

[convolutional]
filters=128
size=1
stride=1
pad=1
activation=ramp

[convolutional]
filters=256
size=3
stride=1
pad=1
activation=ramp

[convolutional]
filters=128
size=1
stride=1
pad=1
activation=ramp

[convolutional]
filters=512
size=3
stride=2
pad=1
activation=ramp

[convolutional]
filters=256
size=1
stride=1
pad=1
activation=ramp

[convolutional]
filters=512
size=3
stride=1
pad=1
activation=ramp

[convolutional]
filters=256
size=1
stride=1
pad=1
activation=ramp

[convolutional]
filters=512
size=3
stride=1
pad=1
activation=ramp

[convolutional]
filters=256
size=1
stride=1
pad=1
activation=ramp

[convolutional]
filters=512
size=3
stride=1
pad=1
activation=ramp

[convolutional]
filters=256
size=1
stride=1
pad=1
activation=ramp

[convolutional]
filters=512
size=3
stride=1
pad=1
activation=ramp

[convolutional]
filters=256
size=1
stride=1
pad=1
activation=ramp

[convolutional]
filters=1024
size=3
stride=2
pad=1
activation=ramp

[convolutional]
filters=512
size=1
stride=1
pad=1
activation=ramp

[convolutional]
filters=1024
size=3
stride=1
pad=1
activation=ramp

[convolutional]
size=3
stride=1
pad=1
filters=1024
activation=ramp

[convolutional]
size=3
stride=2
pad=1
filters=1024
activation=ramp

[convolutional]
size=3
stride=1
pad=1
filters=1024
activation=ramp

[convolutional]
size=3
stride=1
pad=1
filters=512
activation=ramp

[connected]
output=2048
activation=ramp

[dropout]
probability=.5

[connected]
output=1225
activation=logistic

[detection]
classes=20
coords=4
rescore=1
joint=0
objectness=1

