[net]
batch=64
subdivisions=8

width=960
height=540
channels=3

angle=0
saturation = 1.5
exposure = 1.5
hue=.1

learning_rate = 0.001
momentum = 0.9
decay=0.0001

max_batches = 60000
policy=steps
steps=1000,40000,50000,55000
scales=.1,,10.0,.1,.1

[convolutional]
batch_normalize=1
filters=16
size=3
stride=1
pad=1
activation=relu

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=relu

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=relu

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=relu

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=relu

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=relu

[maxpool]
size=2
stride=1

[convolutional]
batch_normalize=1
filters=1024
size=3
stride=1
pad=1
activation=relu

### YOLO HEAD ###

# Yolo 1x1x((1+4+num_classes) * num_anchors) regression layer

[convolutional]
size=1
stride=1
pad=1
filters=80
activation=linear

[region]
anchors = 0.309,0.273, 0.648,0.602, 0.763,1.772, 1.045,0.874, 1.552,1.473, 2.069,0.904, 2.697,1.886, 2.872,3.388, 5.087,3.014, 6.826,5.587
bias_match=1

classes=3
coords=4
num=10

softmax=1
jitter=.1
rescore=1

object_scale=4.0
noobject_scale=0.5
class_scale=2.0
coord_scale=2.0

absolute=1
thresh=0.5
random=0
